rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def similar
    id = params[:id]
    @movie = Movie.find(id) # get movie by id
    if not @movie.director? or @movie.director == ''
      flash[:notice] = "'#{@movie.title}' has no director info"
      redirect_to movies_path
    else
      @movie_list = Movie.where(director: @movie.director)